src/cf/src/InformationRegisters/СоставТехКарты/СоставТехКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоставТехКарты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.НормаРасхода</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>СпособИзготовления</name>
    <type>
      <types>EnumRef.СпособыИзготовления</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентПотерь</name>
    <type>
      <types>DefinedType.Процент</types>
    </type>
  </resources>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/AccumulationRegisters/ВзаиморасчётыСПокупателямиНалоговый/ВзаиморасчётыСПокупателямиНалоговый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчётыСПокупателямиНалоговый</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийНалоговые</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратОтПокупателяНалоговый</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ВозвратПоставщикуНалоговый</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчётов</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратОтПокупателяНалоговый</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ВозвратПоставщикуНалоговый</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ТоварыВПереработке/ТоварыВПереработке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВПереработке</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <comment>Переработчик, у которого находятся товары</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПередачаВПереработку</name>
    <type>
      <types>DocumentRef.ПередачаВПереработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Enums/ВидыОперацийЗаказаПокупателя/ВидыОперацийЗаказаПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийЗаказаПокупателя</name>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/СпособыПополненияЗапасов/СпособыПополненияЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПополненияЗапасов</name>
  <enumValues>
    <name>Закупка</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>Оба</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/СпособыИзготовления/СпособыИзготовления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыИзготовления</name>
  <enumValues>
    <name>НашеПроизводство</name>
  </enumValues>
  <enumValues>
    <name>Переработчик</name>
  </enumValues>
  <enumValues>
    <name>Оба</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Allow</posting>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КоммерческоеПредложение</types>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСWEBСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПодтвердилПроверилОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаказаПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Техкарта</name>
      <type>
        <types>DocumentRef.ТехнологическаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиПродукции</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиРодителя</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаЕдиницу</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ТехнологическаяКарта/ТехнологическаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТехнологическаяКарта</name>
  <registerRecords>InformationRegister.СоставТехКарты</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособИзготовления</name>
      <type>
        <types>EnumRef.СпособыИзготовления</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПотерь</name>
      <type>
        <types>DefinedType.Процент</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <comment>Уникальный идентификатор пользователя информационной базы</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходВПрограммуРазрешен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Роли</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтображатьОповещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Внешний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/CommonModules/ОбновлениеПрограммыОбработчики/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы.
//
// Единственная точка регистрации: ПриДобавленииОбработчиковОбновления. Сами
// обработчики - экспортные процедуры без параметров, выполняются ядром
// (ОбновлениеПрограммы) по возрастанию версий и только один раз на базе.
// Каждый обработчик обязан быть идемпотентным: при падении следующего входа
// он может быть выполнен повторно.
//
// Состояние базы обработчики читают под любым пользователем, поэтому работают
// в привилегированном режиме.
// BSLLS:SetPrivilegedMode-off
//
// Имена метаданных (ОбъектРасчётов, ВзаиморасчётыСПоставщиками и другие) содержат "ё".
// BSLLS:YoLetterUsage-off
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Регистрирует обработчики обновления.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - см. ОбновлениеПрограммы.НоваяТаблицаОбработчиков
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	// Версии 1.0.11.2 - 1.0.11.6: одноразовые заполнения данных волн 9-12, до версии 1.0.12.1
	// выполнявшиеся механизмом ОбновлениеДанныхВызовСервера по номеру шага в константе
	// НомерВыполненногоЗаполненияДанных (см. СтартоваяВерсияИнформационнойБазы). Порядок версий
	// повторяет прежний порядок шагов, поэтому базы клиентов не выполняют их повторно.

	РежимМонопольно = "Монопольно";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.11.2";
	Обработчик.РежимВыполнения = РежимМонопольно;
	Обработчик.Процедура = "ОбновлениеПрограммыОбработчики.ЗаполнитьПризнакЦенаВключаетНДС";
	Обработчик.Комментарий = НСтр("ru = 'Признак ""Цена включает НДС"" в исторических документах.';
		|fr = 'Attribut « Prix TTC » dans les documents historiques.';
		|en = 'The ""Price includes VAT"" attribute in historical documents.';
		|es = 'El atributo ""El precio incluye IVA"" en los documentos históricos.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.11.3";
	Обработчик.РежимВыполнения = РежимМонопольно;
	Обработчик.Процедура = "ОбновлениеПрограммыОбработчики.ЗаполнитьОбъектРасчётовНалоговыхРегистров";
	Обработчик.Комментарий = НСтр("ru = 'Объект расчётов в налоговых регистрах взаиморасчётов.';
		|fr = 'Objet de règlement dans les registres fiscaux des règlements mutuels.';
		|en = 'Settlement object in tax registers of mutual settlements.';
		|es = 'Objeto de liquidación en los registros fiscales de liquidaciones mutuas.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.11.4";
	Обработчик.РежимВыполнения = РежимМонопольно;
	Обработчик.Процедура = "ОбновлениеПрограммыОбработчики.ЗаполнитьПроизводственныеСтатусыЗаказов";
	Обработчик.Комментарий = НСтр("ru = 'Производственные статусы заказов покупателей.';
		|fr = 'Statuts de production des commandes clients.';
		|en = 'Production statuses of sales orders.';
		|es = 'Estados de producción de los pedidos de clientes.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.11.5";
	Обработчик.РежимВыполнения = РежимМонопольно;
	Обработчик.Процедура = "ОбновлениеПрограммыОбработчики.ЗаполнитьЗаказВДвиженияхПереработки";
	Обработчик.Комментарий = НСтр("ru = 'Заказ покупателя в движениях товаров в переработке.';
		|fr = 'Commande client dans les mouvements des marchandises en sous-traitance.';
		|en = 'Sales order in movements of goods in processing.';
		|es = 'Pedido de cliente en los movimientos de mercancías en procesamiento.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.11.6";
	Обработчик.РежимВыполнения = РежимМонопольно;
	Обработчик.Процедура = "ОбновлениеПрограммыОбработчики.ЗаполнитьГотовуюПродукциюВыпусков";
	Обработчик.Комментарий = НСтр("ru = 'Табличная часть готовой продукции в выпусках.';
		|fr = 'Partie tabulaire des produits finis dans les sorties de production.';
		|en = 'Tabular section of finished products in production issues.';
		|es = 'Sección tabular de productos terminados en las emisiones.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.15.2";
	Обработчик.РежимВыполнения = РежимМонопольно;
	Обработчик.Процедура = "ОбновлениеПрограммыОбработчики.ПеренестиТехнологическиеКарты";
	Обработчик.Комментарий = НСтр("ru = 'Перенос технологических карт номенклатуры в документы с историей.';
		|fr = 'Transfert des gammes de fabrication des articles vers des documents avec historique.';
		|en = 'Transfer of item production routings to documents with version history.';
		|es = 'Traslado de las rutas de fabricación de artículos a documentos con historial.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.15.7";
	Обработчик.РежимВыполнения = РежимМонопольно;
	Обработчик.Процедура = "ОбновлениеПрограммыОбработчики.ЗаполнитьСпособыПополненияЗапасов";
	Обработчик.Комментарий = НСтр("ru = 'Способы пополнения запасов существующей номенклатуры.';
		|fr = 'Modes de réapprovisionnement des stocks pour les articles existants.';
		|en = 'Inventory replenishment methods for existing items.';
		|es = 'Métodos de reposición de existencias para los artículos existentes.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.15.9";
	Обработчик.РежимВыполнения = РежимМонопольно;
	Обработчик.Процедура = "ОбновлениеПрограммыОбработчики.ЗаполнитьВидОперацииЗаказовПокупателей";
	Обработчик.Комментарий = НСтр("ru = 'Вид операции «Продажа» у существующих заказов клиентов.';
		|fr = 'Type d’opération « Vente » pour les commandes clients existantes.';
		|en = 'Sale operation type for existing customer orders.';
		|es = 'Tipo de operación «Venta» para los pedidos de clientes existentes.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.15.28";
	Обработчик.РежимВыполнения = РежимМонопольно;
	Обработчик.Процедура = "ОбновлениеПрограммыОбработчики.ПеренестиАвтораВОтветственного";
	Обработчик.Комментарий = НСтр("ru = 'Перенос автора документов и справочников в ответственного.';
		|fr = 'Transfert de l’auteur des documents et des référentiels vers le responsable.';
		|en = 'Transfer of the author of documents and catalogs to the person responsible.';
		|es = 'Traslado del autor de documentos y catálogos al responsable.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.15.39";
	Обработчик.РежимВыполнения = РежимМонопольно;
	Обработчик.Процедура = "ОбновлениеПрограммыОбработчики.ЗаполнитьСпособыИзготовленияТехкарт";
	Обработчик.Комментарий = НСтр("ru = 'Способ изготовления ""Наше производство"" в существующих технологических картах.';
		|fr = 'Mode de fabrication « Notre production » dans les gammes de fabrication existantes.';
		|en = 'The ""In-house production"" manufacturing method in existing production routings.';
		|es = 'Método de fabricación «Producción propia» en las rutas de fabricación existentes.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.15.42";
	Обработчик.РежимВыполнения = РежимМонопольно;
	Обработчик.Процедура = "ОбновлениеПрограммыОбработчики.ЗаполнитьПризнакАвтовыпусков";
	Обработчик.Комментарий = НСтр("ru = 'Признак ""Создан автоматически"" у выпусков, созданных механизмом автовыпуска.';
		|fr = 'Indicateur « Créé automatiquement » sur les productions créées par le mécanisme de production automatique.';
		|en = 'The ""Created automatically"" flag on production outputs created by the automatic output mechanism.';
		|es = 'Indicador «Creado automáticamente» en las producciones creadas por el mecanismo de producción automática.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.15.48";
	Обработчик.РежимВыполнения = РежимМонопольно;
	Обработчик.Процедура = "ОбновлениеПрограммыОбработчики.ЗаполнитьУслугиИПризнакПоступленийИзПереработки";
	Обработчик.Комментарий = НСтр("ru = 'Услуги переработчика по строкам продукции и признак ручной правки сырья
		|в поступлениях из переработки.';
		|fr = 'Services du sous-traitant par ligne de produit et indicateur de matières modifiées manuellement
		|dans les réceptions de sous-traitance.';
		|en = 'Processor services by product line and the manually edited materials flag
		|in subcontracting receipts.';
		|es = 'Servicios del procesador por línea de producto e indicador de materias modificadas manualmente
		|en las recepciones de subcontratación.'");

	// Функциональные опции перестройки меню (docs/plans/menu-restructure.md, этап 1б). Флаг
	// НачальноеЗаполнение - фильтр, а не «ещё и»: одна регистрация доходит до существующих баз,
	// другая - до новых.
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.16.5";
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.Процедура = "ОбновлениеПрограммыОбработчики.ВключитьНовыеФункциональныеОпции";
	Обработчик.Комментарий = НСтр("ru = 'Новые функциональные опции включены: всё, что было в меню, остаётся в меню.';
		|fr = 'Nouvelles options fonctionnelles activées : tout ce qui était dans le menu y reste.';
		|en = 'New functional options enabled: everything that was in the menu stays there.';
		|es = 'Nuevas opciones funcionales activadas: todo lo que estaba en el menú sigue en él.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.16.5";
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеПрограммыОбработчики.ВключитьНовыеФункциональныеОпции";
	Обработчик.Комментарий = НСтр("ru = 'Функциональные опции новой базы включены; выбор - в мастере первого запуска.';
		|fr = 'Options fonctionnelles de la nouvelle base activées ; le choix se fait dans l''assistant de premier lancement.';
		|en = 'Functional options of the new infobase enabled; the choice is made in the first start wizard.';
		|es = 'Opciones funcionales de la nueva base activadas; la elección se hace en el asistente de primer inicio.'");

КонецПроцедуры

// Версия данных базы, с которой начинается обновление, когда записи в регистре
// ВерсииПодсистем ещё нет.
//
// Возвращаемое значение:
//  Строка - версия; пустая строка для новой (пустой) базы
//
Функция СтартоваяВерсияИнформационнойБазы() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Если ЭтоПустаяИнформационнаяБаза() Тогда
		Возврат "";
	КонецЕсли;

	// Конвертация механизма волны 11.1: номер последнего выполненного шага заполнения данных
	// соответствует версии одноимённого обработчика (шаг N - версия 1.0.11.(N+1)), поэтому уже
	// выполненные на базе клиента шаги не выполняются повторно, а невыполненные - выполняются.
	НомерШага = Константы.НомерВыполненногоЗаполненияДанных.Получить();
	Возврат "1.0.11." + Формат(НомерШага + 1, "ЧГ=0");

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет пустой вид операции у существующих заказов клиентов значением «Продажа» (E4).
// Запись в режиме загрузки не запускает ПередЗаписью и ПриЗаписи документа: не меняются итоги,
// история статусов и статус коммерческого предложения; помеченные на удаление заказы тоже
// заполняются. Повторный запуск не выбирает уже обработанные заказы.
//
Процедура ЗаполнитьВидОперацииЗаказовПокупателей() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказаПокупателя.ПустаяСсылка)";

	// Объектная запись каждого заказа в монопольном режиме: число заказов пишется в журнал
	// до цикла, чтобы по журналу было видно, чего ждать на большой базе.
	Результат = Запрос.Выполнить();
	ШаблонНачала = НСтр("ru = 'Вид операции заказов клиентов: к заполнению заказов: %1';
		|fr = 'Type d’opération des commandes clients : commandes à renseigner : %1';
		|en = 'Customer order operation type: orders to populate: %1';
		|es = 'Tipo de operación de pedidos de clientes: pedidos por completar: %1'");
	Выборка = Результат.Выбрать();
	ЗаписатьВЖурнал(СтрШаблон(ШаблонНачала, Выборка.Количество()));

	КоличествоЗаполнено = 0;
	Пока Выборка.Следующий() Цикл
		ОбъектЗаказа = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектЗаказа.ВидОперации = Перечисления.ВидыОперацийЗаказаПокупателя.Продажа;
		ОбъектЗаказа.ОбменДанными.Загрузка = Истина;
		ОбъектЗаказа.Записать();
		КоличествоЗаполнено = КоличествоЗаполнено + 1;
	КонецЦикла;

	ШаблонСообщения = НСтр("ru = 'Вид операции заказов клиентов: заполнено заказов: %1';
		|fr = 'Type d’opération des commandes clients : commandes renseignées : %1';
		|en = 'Customer order operation type: orders populated: %1';
		|es = 'Tipo de operación de pedidos de clientes: pedidos completados: %1'");
	ЗаписатьВЖурнал(СтрШаблон(ШаблонСообщения, КоличествоЗаполнено));

КонецПроцедуры

// BSLLS:DeprecatedMethodCall-off - перенос читает устаревший общий реквизит УдалитьАвторОбщий по назначению.
// Переносит автора (общий реквизит УдалитьАвторОбщий) в реквизит Ответственный (2.0.15.28): решение владельца
// 2026-09-14 оставить один из дублирующих реквизитов. Переносится только в пустой Ответственный типа «Пользователь»;
// запись в режиме загрузки не запускает ПередЗаписью и ПриЗаписи, не перепроводит документ и не трогает связанные.
// Авторы, которые не перенесены (Ответственный заполнен другим пользователем, другого типа или его нет), пишутся
// в журнал регистрации парами «объект - автор»: по ним принимается решение перед удалением общего реквизита.
// Повторный запуск выбирает только записи с пустым ответственным.
//
Процедура ПеренестиАвтораВОтветственного() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Реквизит = Метаданные.ОбщиеРеквизиты.УдалитьАвторОбщий;
	ТипПользователя = Тип("СправочникСсылка.Пользователи");
	Перенесено = 0;
	НеПеренесено = 0;
	Для Каждого ЭлементСостава Из Реквизит.Состав Цикл
		ОбъектМетаданных = ЭлементСостава.Метаданные;
		Если Не ОбщийРеквизитИспользуется(Реквизит, ЭлементСостава) Или Не ОбъектСРеквизитами(ОбъектМетаданных) Тогда
			Продолжить;
		КонецЕсли;
		РеквизитОтветственный = ОбъектМетаданных.Реквизиты.Найти("Ответственный");
		Если РеквизитОтветственный <> Неопределено И РеквизитОтветственный.Тип.СодержитТип(ТипПользователя) Тогда
			Перенесено = Перенесено + ПеренестиАвтораОбъекта(ОбъектМетаданных, РеквизитОтветственный);
			НеПеренесено = НеПеренесено + ЗаписатьНеперенесенныхАвторов(ОбъектМетаданных, Истина);
		Иначе
			НеПеренесено = НеПеренесено + ЗаписатьНеперенесенныхАвторов(ОбъектМетаданных, Ложь);
		КонецЕсли;
	КонецЦикла;

	ШаблонСообщения = НСтр("ru = 'Автор в ответственного: перенесено записей: %1, не перенесено: %2';
		|fr = 'Auteur vers responsable : enregistrements transférés : %1, non transférés : %2';
		|en = 'Author to person responsible: records transferred: %1, not transferred: %2';
		|es = 'Autor a responsable: registros trasladados: %1, no trasladados: %2'");
	ЗаписатьВЖурнал(СтрШаблон(ШаблонСообщения, Перенесено, НеПеренесено));

КонецПроцедуры
// BSLLS:DeprecatedMethodCall-on

// Заполняет пустой способ пополнения у существующих элементов номенклатуры (E2).
// Группы и явно выбранные значения, включая "Оба", не изменяются. Запись в режиме
// загрузки сохраняет прежнюю ветку ПередЗаписью; значение задаётся здесь явно.
// Повторный запуск не выбирает уже обработанные элементы.
//
Процедура ЗаполнитьСпособыПополненияЗапасов() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И Номенклатура.СпособПополнения = ЗНАЧЕНИЕ(Перечисление.СпособыПополненияЗапасов.ПустаяСсылка)";

	КоличествоЗаполнено = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектНоменклатуры = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектНоменклатуры.СпособПополнения = Справочники.Номенклатура.СпособПополненияПоУмолчанию(
			Выборка.ТипНоменклатуры);
		ОбъектНоменклатуры.ОбменДанными.Загрузка = Истина;
		ОбъектНоменклатуры.Записать();
		КоличествоЗаполнено = КоличествоЗаполнено + 1;
	КонецЦикла;

	ШаблонСообщения = НСтр("ru = 'Способы пополнения запасов: заполнено элементов: %1';
		|fr = 'Modes de réapprovisionnement des stocks : articles renseignés : %1';
		|en = 'Inventory replenishment methods: items populated: %1';
		|es = 'Métodos de reposición de existencias: artículos completados: %1'");
	ЗаписатьВЖурнал(СтрШаблон(ШаблонСообщения, КоличествоЗаполнено));

КонецПроцедуры

// Переносит прежнюю табличную часть номенклатуры в документы технологических карт (E1).
// Выполняется монопольно механизмом обновления. Каждая запись документа и его движений
// атомарна; повтор после сбоя пропускает уже перенесённую продукцию. Любая запись регистра,
// включая будущую версию и маркер отмены, запрещает перенос. Записанные вручную документы
// без движений тоже сохраняются. Исходная табличная часть остаётся для совместимости.
//
Процедура ПеренестиТехнологическиеКарты() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтарыйСостав.Ссылка КАК Продукция,
	|	СпрНоменклатура.ДатаСоздания КАК ДатаСоздания,
	|	СтарыйСостав.НомерСтроки КАК НомерСтроки,
	|	СтарыйСостав.Номенклатура КАК Номенклатура,
	|	СтарыйСостав.ЕИ КАК Упаковка,
	|	СтарыйСостав.Количество КАК Количество
	|ИЗ
	|	Справочник.Номенклатура.ТехнологическаяКарта КАК СтарыйСостав
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО СтарыйСостав.Ссылка = СпрНоменклатура.Ссылка
	|ГДЕ
	|	НЕ СтарыйСостав.Ссылка В
	|		(ВЫБРАТЬ Состав.Продукция КАК Продукция ИЗ РегистрСведений.СоставТехКарты КАК Состав)
	|	И НЕ СтарыйСостав.Ссылка В
	|		(ВЫБРАТЬ Карта.Номенклатура КАК Продукция ИЗ Документ.ТехнологическаяКарта КАК Карта)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Продукция,
	|	НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(ДатаСоздания)
	|ПО
	|	Продукция";

	КоличествоПеренесено = 0;
	Продукция = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Продукция.Следующий() Цикл
		Карта = Документы.ТехнологическаяКарта.СоздатьДокумент();
		Карта.Заполнить(Неопределено);
		Карта.Номенклатура = Продукция.Продукция;
		Карта.Дата = ?(ЗначениеЗаполнено(Продукция.ДатаСоздания), Продукция.ДатаСоздания, Дата(2000, 1, 1));
		СтрокиСостава = Продукция.Выбрать();
		Пока СтрокиСостава.Следующий() Цикл
			// В прежней карте характеристики нет; в новой строке остаётся пустая ссылка.
			ЗаполнитьЗначенияСвойств(Карта.ТЧМатериалы.Добавить(), СтрокиСостава,
				"Номенклатура, Упаковка, Количество");
		КонецЦикла;
		Карта.Записать(РежимЗаписиДокумента.Проведение);
		КоличествоПеренесено = КоличествоПеренесено + 1;
	КонецЦикла;

	ШаблонСообщения = НСтр("ru = 'Перенос технологических карт: создано документов: %1';
		|fr = 'Transfert des gammes de fabrication : documents créés : %1';
		|en = 'Production routing migration: documents created: %1';
		|es = 'Traslado de rutas de fabricación: documentos creados: %1'");
	ЗаписатьВЖурнал(СтрШаблон(ШаблонСообщения, КоличествоПеренесено));

КонецПроцедуры

// Проставляет способ изготовления "Наше производство" в технологических картах, заведённых до его
// появления (S1 волны переработки). Процент потерь не трогается: ноль и так ноль.
//
// Правится и документ, и движения, и по отдельности этого мало. Только регистр - первое же
// перепроведение старой карты перезапишет движения из ТЧМатериалы документа пустым значением.
// Только документ - действующие версии в регистре останутся пустыми до перепроведения, и состав
// карты вернёт пустой способ и в карточку номенклатуры, и в перенос значений при проведении заказа.
//
// Документы записываются без проведения: перепроведение всех карт базы подняло бы блокировки и
// сдвинуло движения, а признак проведения и движения запись в режиме загрузки не трогает.
// Маркерная запись отмены карты (пустой материал) остаётся с пустым способом - её отсекают все
// чтения состава. Идемпотентность держится на отборах "способ не заполнен": повтор после сбоя
// не выбирает уже обработанное.
//
Процедура ЗаполнитьСпособыИзготовленияТехкарт() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	СпособПоУмолчанию = Перечисления.СпособыИзготовления.НашеПроизводство;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Материалы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ТехнологическаяКарта.ТЧМатериалы КАК Материалы
	|ГДЕ
	|	Материалы.СпособИзготовления = ЗНАЧЕНИЕ(Перечисление.СпособыИзготовления.ПустаяСсылка)
	|	И Материалы.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";

	КартПравлено = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Карта = Выборка.Ссылка.ПолучитьОбъект();
		Для Каждого Стр Из Карта.ТЧМатериалы Цикл
			// Строка без материала способа не получает - так же, как маркерная запись отмены карты
			// в движениях: обе описывают «материала нет», а не способ его изготовления.
			Если ЗначениеЗаполнено(Стр.Номенклатура) И Не ЗначениеЗаполнено(Стр.СпособИзготовления) Тогда
				Стр.СпособИзготовления = СпособПоУмолчанию;
			КонецЕсли;
		КонецЦикла;
		Карта.ОбменДанными.Загрузка = Истина;
		Карта.Записать();
		КартПравлено = КартПравлено + 1;
	КонецЦикла;

	ЗапросДвижений = Новый Запрос;
	ЗапросДвижений.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Состав.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.СоставТехКарты КАК Состав
	|ГДЕ
	|	Состав.СпособИзготовления = ЗНАЧЕНИЕ(Перечисление.СпособыИзготовления.ПустаяСсылка)
	|	И Состав.Материал <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";

	НаборовПравлено = 0;
	ВыборкаДвижений = ЗапросДвижений.Выполнить().Выбрать();
	Пока ВыборкаДвижений.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.СоставТехКарты.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДвижений.Регистратор);
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			Если ЗначениеЗаполнено(Запись.Материал) И Не ЗначениеЗаполнено(Запись.СпособИзготовления) Тогда
				Запись.СпособИзготовления = СпособПоУмолчанию;
			КонецЕсли;
		КонецЦикла;
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
		НаборовПравлено = НаборовПравлено + 1;
	КонецЦикла;

	ШаблонСообщения = НСтр("ru = 'Способы изготовления техкарт: документов: %1, наборов движений: %2';
		|fr = 'Modes de fabrication des gammes : documents : %1, jeux de mouvements : %2';
		|en = 'Routing manufacturing methods: documents: %1, movement sets: %2';
		|es = 'Métodos de fabricación de rutas: documentos: %1, conjuntos de movimientos: %2'");
	ЗаписатьВЖурнал(СтрШаблон(ШаблонСообщения, КартПравлено, НаборовПравлено));

КонецПроцедуры

// Проставляет признак ЦенаВключаетНДС в документах, введённых до его появления (волна 9).
// История продаж велась в ценах с НДС; признак проставляется прямой записью реквизита,
// без перепроведения (wave9-check.md, п. 2).
//
Процедура ЗаполнитьПризнакЦенаВключаетНДС() Экспорт

	МоментОбновления = ТекущаяДатаСеанса();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя КАК Т
	|ГДЕ
	|	НЕ Т.ЦенаВключаетНДС
	|	И Т.Дата < &МоментОбновления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Т
	|ГДЕ
	|	НЕ Т.ЦенаВключаетНДС
	|	И Т.Дата < &МоментОбновления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка
	|ИЗ
	|	Документ.НалоговаяНакладная КАК Т
	|ГДЕ
	|	НЕ Т.ЦенаВключаетНДС
	|	И Т.Дата < &МоментОбновления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка
	|ИЗ
	|	Документ.ВозвратОтПокупателя КАК Т
	|ГДЕ
	|	НЕ Т.ЦенаВключаетНДС
	|	И Т.Дата < &МоментОбновления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка
	|ИЗ
	|	Документ.ВозвратОтПокупателяНалоговый КАК Т
	|ГДЕ
	|	НЕ Т.ЦенаВключаетНДС
	|	И Т.Дата < &МоментОбновления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка
	|ИЗ
	|	Документ.ОприходованиеТоваров КАК Т
	|ГДЕ
	|	НЕ Т.ЦенаВключаетНДС
	|	И Т.Дата < &МоментОбновления";
	Запрос.УстановитьПараметр("МоментОбновления", МоментОбновления);

	КоличествоОбновлено = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.ЦенаВключаетНДС = Истина;
		ДокОбъект.ОбменДанными.Загрузка = Истина;
		ДокОбъект.Записать();
		КоличествоОбновлено = КоличествоОбновлено + 1;
	КонецЦикла;

	ШаблонСообщения = НСтр("ru = 'Заполнение ЦенаВключаетНДС: обновлено документов: %1';
		|fr = 'Remplissage de PrixTTC : documents mis à jour : %1';
		|en = 'Filling of PriceIncludesVAT: documents updated: %1';
		|es = 'Relleno de PrecioIncluyeIVA: documentos actualizados: %1'");
	ЗаписатьВЖурнал(СтрШаблон(ШаблонСообщения, КоличествоОбновлено));

КонецПроцедуры

// Заполняет измерение ОбъектРасчётов налоговых регистров взаиморасчётов (волна 10)
// значением реквизита ДокументДвижения, без перепроведения (wave10-check.md, п. 3.3).
//
Процедура ЗаполнитьОбъектРасчётовНалоговыхРегистров() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ВзаиморасчётыСПокупателямиНалоговый КАК Т
	|ГДЕ
	|	Т.ОбъектРасчётов = НЕОПРЕДЕЛЕНО
	|	И Т.ДокументДвижения <> НЕОПРЕДЕЛЕНО";
	ЗаполнитьОбъектРасчётовРегистра("ВзаиморасчётыСПокупателямиНалоговый", Запрос);

	// Во втором регистре латинская "c" в имени - как в метаданных.
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "СПокупателями", "СПоcтавщиками");
	ЗаполнитьОбъектРасчётовРегистра("ВзаиморасчётыСПоcтавщикамиНалоговый", Запрос);

КонецПроцедуры

// Пересчитывает производственные статусы заказов покупателей (волна 12) по проведённым
// производственным документам: статус берётся по последнему связанному документу, запись
// в историю добавляется, только если статус отличается.
//
Процедура ЗаполнитьПроизводственныеСтатусыЗаказов() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Основание КАК Основание
	|ИЗ
	|	Документ.ПередачаВПереработку КАК Т
	|ГДЕ
	|	Т.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Основание
	|ИЗ
	|	Документ.ПоступлениеИзПереработки КАК Т
	|ГДЕ
	|	Т.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Основание
	|ИЗ
	|	Документ.ВыпускПродукции КАК Т
	|ГДЕ
	|	Т.Проведен";

	КоличествоЗаказов = 0;
	ОбработанныеЗаказы = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Заказ = РаботаСДокументами.ПолучитьДокументРодительПоТипу(
			Тип("ДокументСсылка.ЗаказПокупателя"), Выборка.Основание);
		Если ЗначениеЗаполнено(Заказ) И ОбработанныеЗаказы[Заказ] = Неопределено Тогда
			ОбработанныеЗаказы.Вставить(Заказ, Истина);
			РаботаСДокументами.ОбновитьСтатусЗаказаПоСвязанным(Заказ);
			КоличествоЗаказов = КоличествоЗаказов + 1;
		КонецЕсли;
	КонецЦикла;

	ШаблонСообщения = НСтр("ru = 'Заполнение производственных статусов: пересчитано заказов: %1';
		|fr = 'Remplissage des statuts de production : commandes recalculées : %1';
		|en = 'Filling of production statuses: orders recalculated: %1';
		|es = 'Relleno de los estados de producción: pedidos recalculados: %1'");
	ЗаписатьВЖурнал(СтрШаблон(ШаблонСообщения, КоличествоЗаказов));

КонецПроцедуры

// Заполняет измерение ЗаказПокупателя регистра ТоварыВПереработке (волна 12) по цепочке
// оснований регистратора, наборами записей, без перепроведения.
//
Процедура ЗаполнитьЗаказВДвиженияхПереработки() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ТоварыВПереработке КАК Т
	|ГДЕ
	|	Т.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)";

	КоличествоРегистраторов = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Заказ = РаботаСДокументами.ПолучитьДокументРодительПоТипу(
			Тип("ДокументСсылка.ЗаказПокупателя"), Выборка.Регистратор.Основание);
		Если Не ЗначениеЗаполнено(Заказ) Тогда
			Продолжить;
		КонецЕсли;
		НаборЗаписей = РегистрыНакопления.ТоварыВПереработке.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		ЕстьИзменения = Ложь;
		Для Каждого Запись Из НаборЗаписей Цикл
			Если Не ЗначениеЗаполнено(Запись.ЗаказПокупателя) Тогда
				Запись.ЗаказПокупателя = Заказ;
				ЕстьИзменения = Истина;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьИзменения Тогда
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
			КоличествоРегистраторов = КоличествоРегистраторов + 1;
		КонецЕсли;
	КонецЦикла;

	ШаблонСообщения = НСтр("ru = 'Заполнение заказа в движениях переработки: обновлено документов: %1';
		|fr = 'Remplissage de la commande dans les mouvements de sous-traitance : documents mis à jour : %1';
		|en = 'Filling of the order in processing movements: documents updated: %1';
		|es = 'Relleno del pedido en los movimientos de procesamiento: documentos actualizados: %1'");
	ЗаписатьВЖурнал(СтрШаблон(ШаблонСообщения, КоличествоРегистраторов));

КонецПроцедуры

// Создаёт строку ТЧГотоваяПродукция документа ВыпускПродукции (волна 12) из шапки
// исторических документов, прямой записью, без перепроведения.
//
Процедура ЗаполнитьГотовуюПродукциюВыпусков() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВыпускПродукции КАК Т
	|ГДЕ
	|	Т.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И НЕ Т.Ссылка В
	|			(ВЫБРАТЬ
	|				ТЧ.Ссылка КАК Ссылка
	|			ИЗ
	|				Документ.ВыпускПродукции.ТЧГотоваяПродукция КАК ТЧ)";

	КоличествоОбновлено = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		НоваяСтрока = ДокОбъект.ТЧГотоваяПродукция.Добавить();
		НоваяСтрока.КодСтроки = 1;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДокОбъект,
			"Номенклатура, Характеристика, Серия, Упаковка, КоличествоУпаковок, Количество");
		ДокОбъект.ОбменДанными.Загрузка = Истина;
		ДокОбъект.Записать();
		КоличествоОбновлено = КоличествоОбновлено + 1;
	КонецЦикла;

	ШаблонСообщения = НСтр("ru = 'Заполнение готовой продукции выпусков: обновлено документов: %1';
		|fr = 'Remplissage des produits finis des sorties de production : documents mis à jour : %1';
		|en = 'Filling of finished products of production issues: documents updated: %1';
		|es = 'Relleno de productos terminados de las emisiones: documentos actualizados: %1'");
	ЗаписатьВЖурнал(СтрШаблон(ШаблонСообщения, КоличествоОбновлено));

КонецПроцедуры

// Ставит признак «Создан автоматически» выпускам, созданным механизмом автовыпуска до появления реквизита
// (сборка 2.0.15.42). До неё автовыпуск опознавался по основанию-реализации, и условие здесь - ровно то же:
// поведение существующих документов не меняется, меняется только способ их опознать.
//
// Пустая ссылка-основание не годится: Производство.ЭтоРеализация требует и тип, и заполненность, а выпуск,
// которому выбрали тип основания без документа, получил бы признак и стал неправимым навсегда - механизм
// его не перезаполнит, он ищет свои выпуски по заполненному основанию.
//
// Запись в режиме загрузки: движения, стадии заказов и проведение не трогаются, признак в их формировании
// не участвует. Помеченные на удаление заполняются тоже. Повторный запуск уже обработанные не выбирает.
//
Процедура ЗаполнитьПризнакАвтовыпусков() Экспорт

	// Режим ставится явно, а не наследуется от ВыполнитьОбновление: обработчик вызывается ещё и напрямую
	// из сценария ТестыДокументов, без этой обёртки.
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВыпускПродукции КАК Т
	|ГДЕ
	|	НЕ Т.СозданАвтоматически
	|	И Т.Основание ССЫЛКА Документ.РеализацияТоваровУслуг
	|	И Т.Основание <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)";

	// Объектная запись каждого выпуска в монопольном режиме: число выпусков пишется в журнал до цикла,
	// чтобы по журналу было видно, чего ждать на большой базе.
	Выборка = Запрос.Выполнить().Выбрать();
	ШаблонНачала = НСтр("ru = 'Признак автосоздания выпусков: к заполнению документов: %1';
		|fr = 'Indicateur de création automatique des productions : documents à renseigner : %1';
		|en = 'Automatic creation flag of production outputs: documents to populate: %1';
		|es = 'Indicador de creación automática de las producciones: documentos por completar: %1'");
	ЗаписатьВЖурнал(СтрШаблон(ШаблонНачала, Выборка.Количество()));

	КоличествоОбновлено = 0;
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.СозданАвтоматически = Истина;
		ДокОбъект.ОбменДанными.Загрузка = Истина;
		ДокОбъект.Записать();
		КоличествоОбновлено = КоличествоОбновлено + 1;
	КонецЦикла;

	ШаблонСообщения = НСтр("ru = 'Признак автосоздания выпусков: обновлено документов: %1';
		|fr = 'Indicateur de création automatique des productions : documents mis à jour : %1';
		|en = 'Automatic creation flag of production outputs: documents updated: %1';
		|es = 'Indicador de creación automática de las producciones: documentos actualizados: %1'");
	ЗаписатьВЖурнал(СтрШаблон(ШаблонСообщения, КоличествоОбновлено));

КонецПроцедуры

// Поступления из переработки до сборки 2.0.15.48: стоимость услуг переработчика раскладывается по строкам продукции,
// признак ручной правки сырья ставится там, где сырьё документа расходится с расчётом по его продукции (S6).
//
// Услуги - по весам технологических карт на дату документа, тем же правилом, что проведение делило их до S6: при
// ручном перепроведении себестоимость строки совпадёт с прежней до копеек округления. Шапка документа - стоимость
// услуг и НДС - не меняется (ревью плана S6, P1-1): иначе шапка разошлась бы с движениями взаиморасчётов, которые
// запись в режиме загрузки не трогает.
//
// Признак ручного сырья: откуда сырьё старого документа (весь остаток передачи до S5-B или правка руками), не знает
// никто, поэтому решает сверка с расчётом (Документы.ПоступлениеИзПереработки.СырьеСовпадаетСРасчетом). Совпало -
// рабочее место производства может его править; расходится - только форма документа (ревью плана S6, P2-1).
//
// Запись в режиме загрузки: проведение, движения и стадии заказов не трогаются. Повтор ничего не пишет: у документа с
// разнесёнными услугами и взведённым признаком менять нечего, а совпадающее с расчётом сырьё признака не получает.
//
// Параметры:
//  Ссылки - Массив из ДокументСсылка.ПоступлениеИзПереработки, Неопределено - обрабатываемые документы; не задан -
//           все. Сценарий ТестыДокументов передаёт свои документы, чтобы не менять документы общей базы прогона.
//
Процедура ЗаполнитьУслугиИПризнакПоступленийИзПереработки(Ссылки = Неопределено) Экспорт

	// Режим ставится явно: обработчик вызывается ещё и напрямую из сценария, без обёртки ВыполнитьОбновление.
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеИзПереработки КАК Т
	|ГДЕ
	|	&УсловиеОтбора
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.Дата,
	|	Т.Ссылка";
	Если Ссылки = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", "ИСТИНА");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", "Т.Ссылка В (&Документы)");
		Запрос.УстановитьПараметр("Документы", Ссылки);
	КонецЕсли;

	Выборка = Запрос.Выполнить().Выбрать();
	ШаблонНачала = НСтр("ru = 'Услуги и признак сырья поступлений из переработки: к проверке документов: %1';
		|fr = 'Services et indicateur de matières des réceptions de sous-traitance : documents à vérifier : %1';
		|en = 'Services and materials flag of subcontracting receipts: documents to check: %1';
		|es = 'Servicios e indicador de materias de las recepciones de subcontratación: documentos por revisar: %1'");
	ЗаписатьВЖурнал(СтрШаблон(ШаблонНачала, Выборка.Количество()));

	МенеджерДокумента = Документы.ПоступлениеИзПереработки;
	КоличествоОбновлено = 0;
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Изменен = Ложь;
		Строки = ДокОбъект.ТЧГотоваяПродукция;
		Если ДокОбъект.СтоимостьУслуг <> 0 И Строки.Количество() > 0 И Строки.Итог("СтоимостьУслуг") = 0 Тогда
			// Шапка сохраняется как есть: процедура распределения пишет в неё ту же сумму.
			МенеджерДокумента.РаспределитьСтоимостьУслуг(ДокОбъект, ДокОбъект.СтоимостьУслуг);
			Изменен = Истина;
		КонецЕсли;
		Если Не ДокОбъект.СырьеИзмененоВручную И ДокОбъект.ТЧТовары.Количество() > 0
			И Не СырьеПоступленияПоРасчету(ДокОбъект) Тогда
			ДокОбъект.СырьеИзмененоВручную = Истина;
			Изменен = Истина;
		КонецЕсли;
		Если Изменен Тогда
			ДокОбъект.ОбменДанными.Загрузка = Истина;
			ДокОбъект.Записать();
			КоличествоОбновлено = КоличествоОбновлено + 1;
		КонецЕсли;
	КонецЦикла;

	ШаблонСообщения = НСтр("ru = 'Услуги и признак сырья поступлений из переработки: обновлено документов: %1';
		|fr = 'Services et indicateur de matières des réceptions de sous-traitance : documents mis à jour : %1';
		|en = 'Services and materials flag of subcontracting receipts: documents updated: %1';
		|es = 'Servicios e indicador de materias de las recepciones de subcontratación: documentos actualizados: %1'");
	ЗаписатьВЖурнал(СтрШаблон(ШаблонСообщения, КоличествоОбновлено));

КонецПроцедуры

// Включает функциональные опции перестройки меню (2.0.16.5), зарегистрирован дважды - для существующих баз
// и для новых: у клиента не должно пропасть ничего, что было в меню. Регламентированный учёт повторяет
// опцию «Бухгалтерия»: план счетов и регистр проводок до этой версии прятала она - так скрытое остаётся
// скрытым и в старой базе, и в новой (там бухгалтерия выключена, пока её не включат в мастере или в
// «Параметрах»). Пишет только выключенные константы, поэтому повтор после сбоя обновления включит лишь то,
// что не успело включиться; опцию, выключенную между проходами, он включит снова.
//
Процедура ВключитьНовыеФункциональныеОпции() Экспорт

	ВключитьОпции(Константы.Бухгалтерия.Получить());

КонецПроцедуры

// Имена констант функциональных опций перестройки меню, которые включает обновление 2.0.16.5. Список
// не пополнять: обработчик уже выполнен в базах на 2.0.16.5 и выше, новая опция требует своего обработчика
// новой версии.
//
// Возвращаемое значение:
//  Массив из Строка - имена констант без «ИспользоватьРегламентированныйУчет»: её значение задаётся отдельно
//
Функция КонстантыНовыхФункциональныхОпций() Экспорт

	Имена = Новый Массив;
	Имена.Добавить("ИспользоватьИмпорт");
	Имена.Добавить("ИспользоватьЗаказыПокупателей");
	Имена.Добавить("ИспользоватьКоммерческиеПредложения");
	Имена.Добавить("ИспользоватьЗадачиЗаказов");
	Имена.Добавить("ИспользоватьЗаявкиНаПоискТовара");
	Имена.Добавить("ИспользоватьРозничныеПродажи");
	Имена.Добавить("ИспользоватьПравилаЦенообразования");
	Имена.Добавить("ИспользоватьЯчейки");
	Имена.Добавить("ИспользоватьПересчеты");
	Имена.Добавить("ИспользоватьКомплектацию");
	Имена.Добавить("ИспользоватьПереработку");
	Имена.Добавить("ИспользоватьАльтернативныеОплаты");
	Имена.Добавить("ИспользоватьЛиды");
	Имена.Добавить("ИспользоватьЛичныйКабинет");
	Возврат Имена;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВключитьОпции(РегламентированныйУчет)

	Включено = 0;
	Для Каждого Имя Из КонстантыНовыхФункциональныхОпций() Цикл
		Если Не Константы[Имя].Получить() Тогда
			Константы[Имя].Установить(Истина);
			Включено = Включено + 1;
		КонецЕсли;
	КонецЦикла;
	Если РегламентированныйУчет И Не Константы.ИспользоватьРегламентированныйУчет.Получить() Тогда
		Константы.ИспользоватьРегламентированныйУчет.Установить(Истина);
		Включено = Включено + 1;
	КонецЕсли;
	ОбновитьПовторноИспользуемыеЗначения();

	ШаблонСообщения = НСтр("ru = 'Функциональные опции перестройки меню: включено %1';
		|fr = 'Options fonctionnelles de la refonte du menu : activées %1';
		|en = 'Menu restructuring functional options: enabled %1';
		|es = 'Opciones funcionales de la reestructuración del menú: activadas %1'");
	ЗаписатьВЖурнал(СтрШаблон(ШаблонСообщения, Включено));

КонецПроцедуры

// Сверка сырья поступления с расчётом для обработчика 2.0.15.48: ошибка расчёта на нестандартном документе клиента
// (битое основание, удалённая номенклатура) не останавливает монопольное обновление - документ считается правленным
// вручную, что безопасно, и ошибка пишется в журнал (ревью S6).
//
// Параметры:
//  ДокОбъект - ДокументОбъект.ПоступлениеИзПереработки - документ.
//
// Возвращаемое значение:
//  Булево - сырьё совпадает с расчётом; при ошибке расчёта - Ложь.
//
Функция СырьеПоступленияПоРасчету(ДокОбъект)

	Попытка
		Возврат Документы.ПоступлениеИзПереработки.СырьеСовпадаетСРасчетом(ДокОбъект);
	Исключение
		Шаблон = НСтр("ru = 'Сырьё поступления %1 не сверено с расчётом, признак ручной правки поставлен: %2';
			|fr = 'Les matières de la réception %1 n''ont pas été comparées au calcul, l''indicateur manuel est posé : %2';
			|en = 'Materials of receipt %1 were not compared with the calculation, the manual flag is set: %2';
			|es = 'Las materias de la recepción %1 no se compararon con el cálculo, se marcó el indicador manual: %2'");
		Подробности = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщение = СтрШаблон(Шаблон, ДокОбъект.Ссылка, Подробности);
		ЗаписатьВЖурнал(Сообщение);
		Возврат Ложь;
	КонецПопытки;

КонецФункции

// Признак новой базы: данных учёта в ней ещё нет, конвертировать нечего.
//
// Возвращаемое значение:
//  Булево - Истина, если в базе нет ни одного элемента справочника Номенклатура
//
Функция ЭтоПустаяИнформационнаяБаза()

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура";
	Возврат Запрос.Выполнить().Пустой();

КонецФункции

// Заполняет ОбъектРасчётов в одном налоговом регистре взаиморасчётов.
//
// Параметры:
//  ИмяРегистра - Строка - имя регистра накопления
//  Запрос      - Запрос - готовый запрос регистраторов с пустым ОбъектРасчётов
//
Процедура ЗаполнитьОбъектРасчётовРегистра(ИмяРегистра, Запрос)

	КоличествоЗаписей = 0;
	КоличествоРегистраторов = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		ЕстьИзменения = Ложь;
		Для Каждого Запись Из НаборЗаписей Цикл
			Если Запись.ОбъектРасчётов = Неопределено И Запись.ДокументДвижения <> Неопределено Тогда
				Запись.ОбъектРасчётов = Запись.ДокументДвижения;
				ЕстьИзменения = Истина;
				КоличествоЗаписей = КоличествоЗаписей + 1;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьИзменения Тогда
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
			КоличествоРегистраторов = КоличествоРегистраторов + 1;
		КонецЕсли;
	КонецЦикла;

	ШаблонСообщения = НСтр("ru = 'Заполнение ОбъектРасчётов регистра %1: обновлено записей: %2 (документов: %3)';
		|fr = 'Remplissage de ObjetDeRèglement du registre %1 : enregistrements mis à jour : %2 (documents : %3)';
		|en = 'Filling of SettlementObject of register %1: records updated: %2 (documents: %3)';
		|es = 'Relleno de ObjetoDeLiquidación del registro %1: registros actualizados: %2 (documentos: %3)'");
	ЗаписатьВЖурнал(СтрШаблон(ШаблонСообщения, ИмяРегистра, КоличествоЗаписей, КоличествоРегистраторов));

КонецПроцедуры

// Общий реквизит есть у объекта: явно или по автоиспользованию.
//
// Параметры:
//  Реквизит       - ОбъектМетаданных - общий реквизит.
//  ЭлементСостава - ЭлементСоставаОбщегоРеквизита - объект из состава.
//
// Возвращаемое значение:
//  Булево - Истина, если реквизит у объекта используется.
//
Функция ОбщийРеквизитИспользуется(Реквизит, ЭлементСостава)

	Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита;
	Если ЭлементСостава.Использование = Использование.Использовать Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат ЭлементСостава.Использование = Использование.Авто
		И Реквизит.АвтоИспользование = Метаданные.СвойстваОбъектов.АвтоИспользованиеОбщегоРеквизита.Использовать;

КонецФункции

// Документ, справочник или план видов характеристик: у журналов и последовательностей реквизитов нет.
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект из состава общего реквизита.
//
// Возвращаемое значение:
//  Булево - Истина для объектов с реквизитами и ссылкой.
//
Функция ОбъектСРеквизитами(ОбъектМетаданных)

	Возврат Метаданные.Документы.Содержит(ОбъектМетаданных)
		Или Метаданные.Справочники.Содержит(ОбъектМетаданных)
		Или Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных);

КонецФункции

// Условие на группы справочника: у групп нет реквизита, используемого только для элементов.
//
// Параметры:
//  ОбъектМетаданных      - ОбъектМетаданных - объект из состава общего реквизита.
//  РеквизитОтветственный - ОбъектМетаданных, Неопределено - реквизит Ответственный.
//
// Возвращаемое значение:
//  Строка - условие запроса, начинающееся с «И», или пустая строка.
//
Функция УсловиеБезГрупп(ОбъектМетаданных, РеквизитОтветственный)

	Если РеквизитОтветственный = Неопределено Или Метаданные.Документы.Содержит(ОбъектМетаданных)
		Или Не ОбъектМетаданных.Иерархический Тогда
		Возврат "";
	КонецЕсли;
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных)
		И ОбъектМетаданных.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияЭлементов Тогда
		Возврат "";
	КонецЕсли;
	Если РеквизитОтветственный.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента Тогда
		Возврат "
		|	И НЕ Т.ЭтоГруппа";
	КонецЕсли;
	Возврат "";

КонецФункции

// Переносит автора в пустой ответственный у записей одного объекта метаданных.
//
// Параметры:
//  ОбъектМетаданных      - ОбъектМетаданных - документ, справочник или план видов характеристик.
//  РеквизитОтветственный - ОбъектМетаданных - реквизит Ответственный типа «Пользователь».
//
// Возвращаемое значение:
//  Число - сколько записей получили ответственного.
//
// BSLLS:QueryParseError-off - имя таблицы подставляется из метаданных.
// BSLLS:DeprecatedMethodCall-off
Функция ПеренестиАвтораОбъекта(ОбъектМетаданных, РеквизитОтветственный)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	" + ОбъектМетаданных.ПолноеИмя() + " КАК Т
	|ГДЕ
	|	Т.УдалитьАвторОбщий <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И Т.УдалитьАвторОбщий ССЫЛКА Справочник.Пользователи
	|	И (Т.Ответственный = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|		ИЛИ Т.Ответственный = НЕОПРЕДЕЛЕНО
	|		ИЛИ Т.Ответственный ЕСТЬ NULL)" + УсловиеБезГрупп(ОбъектМетаданных, РеквизитОтветственный);
	Перенесено = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписьОбъекта = Выборка.Ссылка.ПолучитьОбъект();
		ЗаписьОбъекта.Ответственный = ЗаписьОбъекта.УдалитьАвторОбщий;
		ЗаписьОбъекта.ОбменДанными.Загрузка = Истина;
		ЗаписьОбъекта.Записать();
		Перенесено = Перенесено + 1;
	КонецЦикла;
	Возврат Перенесено;

КонецФункции

// Пишет в журнал авторов, которые остаются только в общем реквизите УдалитьАвторОбщий.
//
// Параметры:
//  ОбъектМетаданных    - ОбъектМетаданных - документ, справочник или план видов характеристик.
//  ЕстьОтветственный   - Булево - у объекта есть Ответственный типа «Пользователь»: в журнал попадают записи,
//                        где он заполнен другим пользователем; иначе - все записи с автором.
//
// Возвращаемое значение:
//  Число - сколько записей с неперенесённым автором.
//
Функция ЗаписатьНеперенесенныхАвторов(ОбъектМетаданных, ЕстьОтветственный)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.УдалитьАвторОбщий КАК Автор
	|ИЗ
	|	" + ОбъектМетаданных.ПолноеИмя() + " КАК Т
	|ГДЕ
	|	Т.УдалитьАвторОбщий <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И Т.УдалитьАвторОбщий ССЫЛКА Справочник.Пользователи";
	Если ЕстьОтветственный Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Т.Ответственный <> Т.УдалитьАвторОбщий
		|	И Т.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|	И Т.Ответственный <> НЕОПРЕДЕЛЕНО
		|	И НЕ Т.Ответственный ЕСТЬ NULL";
	КонецЕсли;
	ШаблонСообщения = НСтр("ru = 'Автор не перенесён: %1 %2 (%3), автор %4 (%5)';
		|fr = 'Auteur non transféré : %1 %2 (%3), auteur %4 (%5)';
		|en = 'Author not transferred: %1 %2 (%3), author %4 (%5)';
		|es = 'Autor no trasladado: %1 %2 (%3), autor %4 (%5)'");
	Количество = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ИдентификаторЗаписи = Выборка.Ссылка.УникальныйИдентификатор();
		ИдентификаторАвтора = Выборка.Автор.УникальныйИдентификатор();
		Сообщение = СтрШаблон(ШаблонСообщения, ОбъектМетаданных.ПолноеИмя(), Выборка.Ссылка, ИдентификаторЗаписи,
			Выборка.Автор, ИдентификаторАвтора);
		ЗаписатьВЖурнал(Сообщение);
		Количество = Количество + 1;
	КонецЦикла;
	Возврат Количество;

КонецФункции
// BSLLS:DeprecatedMethodCall-on
// BSLLS:QueryParseError-on

// Записывает итог обработчика в журнал регистрации.
//
// Параметры:
//  Сообщение - Строка - текст сообщения
//
Процедура ЗаписатьВЖурнал(Сообщение)

	ЗаписьЖурналаРегистрации(ОбновлениеПрограммы.ИмяСобытияЖурнала(),
		УровеньЖурналаРегистрации.Информация, , , Сообщение);

КонецПроцедуры

#КонецОбласти
